/******************************************************************************
;  *   	@MCU				 STM32F103C8T6
;  *   	@Create Date         2023.01.20
;  *    @Official website		 http://www.devechip.com/
;  *----------------------Abstract Description---------------------------------
;  *			    								关断控制处理
**************************************************************************************/

#include "Shutdown.h"
/**
	* @说明	关断函数
	* @参数	
	* @返回值	
	* @注	
*/
void Shutdown(void){
	g_AfeRegs.R1.CST=0x0F;//配置关断

	DVC11XX_WriteRegs(AFE_ADDR_R(1), 1);//写入寄存器
}



